Revit 2026 API

# LinearArrayCreate(Document, View, ICollectionElementId, Int32, XYZ, ArrayAnchorMember) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LinearArray Create(
	Document aDoc,
	View dBView,
	ICollection<ElementId> ids,
	int count,
	XYZ translationToAnchorMember,
	ArrayAnchorMember anchorMember
)
```
```vb
Public Shared Function Create (
	aDoc As Document,
	dBView As View,
	ids As ICollection(Of ElementId),
	count As Integer,
	translationToAnchorMember As XYZ,
	anchorMember As ArrayAnchorMember
) As LinearArray
```
```cpp
public:
static LinearArray^ Create(
	Document^ aDoc,
	View^ dBView,
	ICollection<ElementId^>^ ids,
	int count,
	XYZ^ translationToAnchorMember,
	ArrayAnchorMember anchorMember
)
```
```fsharp
static member Create :
        aDoc : Document *
        dBView : View *
        ids : ICollection<ElementId> *
        count : int *
        translationToAnchorMember : XYZ *
        anchorMember : ArrayAnchorMember -> LinearArray
```

#### Parameters

aDoc Document

dBView View

ids ICollectionElementId

count Int32

translationToAnchorMember XYZ

anchorMember ArrayAnchorMember

#### Return Value

LinearArray

#### Reference

LinearArray Class

Create Overload

Autodesk.Revit.DB Namespace